#+TITLE: Combine
#+INCLUDE: ../themes/comfy_inline/comfy_inline.theme
#+OPTIONS: ^:nil
# -*- org-export-babel-evaluate: nil -*-
#+latex:\newpage

* Operator
About [[file:AdvancedSwiftUI.org::*Publisher and Subscriber][Publisher and Subscriber]]
Operators 可以轉換 publisher 與 subscriber 之間的數據，如map
#+begin_src swift -r -n :results output :exports nil
import Combine

// Publisher
let publisher = Just(5)
// Operator
let publisherString = publisher
  .map{$0.description}
let publisherDouble = publisher
  .map{Double($0)}
// Subscriber
let subcriber = publisher
  .sink(receiveValue: {print($0)})        // 5
let anotherScriber = publisherDouble
  .sink(receiveValue: {print("Another",$0)})         //Another 5.0

#+end_src

#+RESULTS:
: 5
: Another 5.0

** Cancellable
雖然 Subscriber 感覺好像是 必須相依與 Publisher 的, 但是事實上是 Publisher 將事件源頭確立之後, 提供了一個建立 Subscriber 的工廠接口, 而這些接口都會回傳一個 AnyCancellable 的參考型別, 依照 AnyCancellable 文件, 其代表的是 cancellation token 作為取消事件流的途徑, 而由於 ARC 的記憶體管理, 這個 Token 若是沒有保持 ARC 的計數時, 將會在 function Scope 結束後自動解除訂閱.

在 AnyCancellable 只有 3 個 API 可以使用:
#+begin_src swift -r -n :results output :exports nil :eval no
AnyCancellable.cancel()
AnyCancellable.store<C>(in: inout C) where C : RangeReplaceableCollection, C.Element == AnyCancellable
AnyCancellable.store(in: inout Set<AnyCancellable>)
#+end_src

例如：
#+begin_src swift -r -n :results output :exports nil
import Combine

class Weather {
    @Published var temperature: Double
    init(temperature: Double) {
        self.temperature = temperature
    }
}

let weather = Weather(temperature: 20)
let cancellable = weather.$temperature
  .sink() {
      print("Temperature now: \($0)")
  }

weather.temperature = 25
cancellable.cancel() // 取消subscribe
weather.temperature = 30

#+end_src

#+RESULTS:
: Temperature now: 20.0
: Temperature now: 25.0

